{
  "backend/main.mo": "Defines cafe, city, and area types with in‑memory Map storage and provides add, list, search, and get‑by‑id query functions.",
  "feature_evidence.json": "Lists feature evidence entries describing required map replacement and map/list coordination with associated files and test metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files, describing routing, components, hooks, styling, and map implementation.",
  "frontend/index.css": "Defines Tailwind base layers and extensive OKLCH color variables for light and dark mode themes.",
  "frontend/index.html": "Basic HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for search and cafe details pages using AppLayout as the root.",
  "frontend/src/components/cafes/CafeCard.tsx": "Displays cafe information as a clickable card with optional selection state and navigation to cafe details.",
  "frontend/src/components/cafes/CafeTileMap.tsx": "Canvas‑based OpenStreetMap tile renderer with Web Mercator math, marker interactions, and selection/centering support.",
  "frontend/src/components/cafes/EmptyState.tsx": "Shows contextual empty‑state messages depending on search input and results.",
  "frontend/src/components/cafes/LoadingState.tsx": "Renders skeleton placeholders for cafe list loading states.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with header, footer, and main outlet region.",
  "frontend/src/components/layout/Footer.tsx": "Displays footer with attribution and link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Renders sticky header with logo and navigation back to the home page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useCafeDetails.ts": "Fetches detailed cafe data by ID using the authenticated actor with caching and disabled retries.",
  "frontend/src/hooks/useCafeSearch.ts": "Performs a text-based cafe search through the actor, returning empty results when no keyword is provided.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines global Tailwind layers and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers before rendering the root component.",
  "frontend/src/pages/CafeDetailsPage.tsx": "Displays detailed cafe information by ID with loading, error, and navigation handling.",
  "frontend/src/pages/CafeSearchPage.tsx": "Implements a search UI for cafes with keyword/city filters, list and map views, and result interactions.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, plugins, and extended utilities for the project.",
  "project_state.json": "Stores the project’s current build state, requirements, features, and issues, including notes about replacing Google Maps with a deployable tile-based map. It also tracks existing frontend/backend features and known deployment problems."
}