{
  "backend/main.mo": "Motoko backend storing cafes in a map with add, list, search, and get-by-ID functions plus basic text‑based filtering.",
  "feature_evidence.json": "Feature evidence report linking a frontend search update to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and renders the app within the router provider.",
  "frontend/src/components/cafes/CafeCard.tsx": "Cafe card UI component with details, badges, click handling, and optional selection mode.",
  "frontend/src/components/cafes/CafeTileMap.tsx": "Canvas‑based OpenStreetMap tile renderer with wrap-around, panning, zooming, and cafe markers.",
  "frontend/src/components/cafes/EmptyState.tsx": "Shows guidance when no search params are provided and a no‑results message otherwise.",
  "frontend/src/components/cafes/LoadingState.tsx": "Skeleton loading UI displaying placeholder cards during cafe fetches.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper with header, main content outlet, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing attribution, copyright, and link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo and navigation back to the home page.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating an authenticated or anonymous backend actor and refreshing queries on identity change.",
  "frontend/src/hooks/useCafeDetails.ts": "React Query hook that fetches cafe details by ID using the actor API with caching and disabled retries.",
  "frontend/src/hooks/useCafeSearch.ts": "React Query hook that searches cafes by keyword, city, or area, returning an empty array when no search params are provided.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme color palettes.",
  "frontend/src/lib/webMercator.ts": "Utility functions for Web Mercator projections, converting between lat/lng, tiles, pixels, and clamped coordinates.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/CafeDetailsPage.tsx": "Page that loads and displays cafe details, handling loading, not-found, and error states.",
  "frontend/src/pages/CafeSearchPage.tsx": "Cafe search interface with form inputs, list and map views, and selection handling via useCafeSearch.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings using CSS variables.",
  "project_state.json": "Defines the project’s current build state, including map-related deployment issues, search-behavior fixes, and a list of implemented features. Notes requirements for an alternative map solution and improved search filtering logic."
}