{
  "kind": "build_request",
  "title": "Support worldwide map browsing without Google Maps (improve tile map wrapping)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Update the existing tile-based map (OpenStreetMap tiles) to support worldwide browsing reliably by handling longitudinal wrap-around and latitude bounds so panning does not request invalid tiles and the map continues rendering anywhere on Earth.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "This app wants to work for world wide ,so add google map to it."
        ]
      },
      "acceptanceCriteria": [
        "Panning horizontally across the International Date Line continues to render map tiles (tile X wraps correctly for the current zoom level).",
        "Panning vertically does not request tiles outside valid Web Mercator bounds (tile Y is clamped to the valid range for the current zoom level).",
        "No console errors are produced due to invalid tile URLs when panning/zooming around the world."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Adjust the map’s default view so the app feels worldwide-ready when no cafe results are available (e.g., start at a world-level zoom and a neutral center), while preserving the current behavior of centering on the first result or a selected cafe when cafes are present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "This app wants to work for world wide ,so add google map to it."
        ]
      },
      "acceptanceCriteria": [
        "When the map is shown without any cafes/center override, the initial viewport is a world-level view (not a single-city default).",
        "When cafes are present, the map still centers as it does today (first cafe by default, and centers on a cafe when selected from the list)."
      ]
    }
  ],
  "constraints": [
    "Do not add Google Maps (SDK, script tag, or any @googlemaps/* packages); the deployment/preview environment is known to fail with Google Maps integrations.",
    "Do not modify any files under frontend/src/components/ui (immutable UI sources).",
    "Keep the existing warm, earthy theme and current map/list coordination behavior."
  ],
  "nonGoals": [
    "Adding Google Maps Platform, Google Places APIs, or any Google billing/API-key-based integration.",
    "Implementing geocoding/place search via third-party APIs (e.g., converting a typed city to coordinates)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}