{
  "kind": "build_request",
  "title": "Fix cafe search so keyword is optional and city/area work independently",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Update the Motoko backend searchCafes logic so that keyword matching is optional and city and area filters can return results independently (i.e., any combination of keyword, city, and area should work, including city-only and area-only searches).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes..make keywords is optional , city & area works.. if the user search tea, coffee, ect . It wants show near by shop and if user search particular city/area also wants to visible to user."
        ]
      },
      "acceptanceCriteria": [
        "Calling searchCafes with an empty/blank keyword and a non-empty city returns cafes whose city matches (case-insensitive, partial match).",
        "Calling searchCafes with an empty/blank keyword and a non-empty area returns cafes whose area matches (case-insensitive, partial match).",
        "Calling searchCafes with a non-empty keyword and empty city/area returns cafes whose name matches the keyword (case-insensitive, partial match).",
        "Calling searchCafes with keyword+city and/or keyword+area and/or city+area returns cafes that satisfy all provided (non-null / non-blank) filters.",
        "If all three inputs are empty/blank, the backend returns an empty result set (to avoid returning all cafes unintentionally).",
        "Search results remain sorted by cafe name as they are today."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Update the frontend cafe search form and data hook so users can search when keyword is empty as long as city and/or area is provided, and ensure both city and area are passed to the backend searchCafes call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make keywords is optional , city & area works"
        ]
      },
      "acceptanceCriteria": [
        "The search button is enabled when at least one of: keyword, city, or area has non-whitespace content.",
        "Submitting the form triggers a React Query search request when at least one field is provided; it does not require keyword.",
        "The frontend search hook includes keyword, city, and area in its queryKey and passes all three to actor.searchCafes(keyword, cityOrNull, areaOrNull).",
        "The UI provides separate inputs for City and Area (or otherwise captures both values distinctly) and uses English labels/placeholders.",
        "The empty state and results summary text correctly reflect searches that may omit keyword (e.g., city-only/area-only searches do not display misleading 'Showing results for \"\"')."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or any other path listed in frontend.immutablePaths; compose existing components instead.",
    "Keep user-facing text in English."
  ],
  "nonGoals": [
    "Implementing true 'nearby' geolocation-based search (distance calculations) based on user GPS location.",
    "Adding maps provider integrations (e.g., Google Maps) or changing the existing tile-based map implementation.",
    "Adding new data fields (e.g., cafe categories/tags) beyond using existing name/city/area fields for matching."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}