{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Worldwide-ready OpenStreetMap tile browsing (wrap-around + bounds + neutral default view)",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Prevent invalid OpenStreetMap tile requests by adding longitudinal wrap-around, Web Mercator latitude clamping, and tile Y bounds handling in the canvas tile map renderer.",
      "acceptanceCriteria": [
        "Panning horizontally across the International Date Line continues to render map tiles (tile X wraps correctly for the current zoom level).",
        "Panning vertically does not request tiles outside valid Web Mercator bounds (tile Y is clamped to the valid range for the current zoom level).",
        "No console errors are produced due to invalid tile URLs when panning/zooming around the world."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/webMercator.ts",
          "operation": "create",
          "description": "Add reusable Web Mercator helpers: clamp latitude to valid Mercator range, normalize longitude into [-180, 180), convert lat/lng <-> pixel space, wrap tile X by zoom world width (2^zoom), and clamp tile Y to [0, 2^zoom - 1]."
        },
        {
          "path": "frontend/src/components/cafes/CafeTileMap.tsx",
          "operation": "modify",
          "description": "Update tile math to use Web Mercator helpers so rendering works worldwide: normalize center longitude, clamp center latitude, wrap requested tileX for the URL/cache key while keeping drawing positions consistent, and clamp the tileY loop range so no invalid tile URLs are ever requested when panning/zooming."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Use a world-level default map viewport when there are no cafe results/center override, while preserving current behavior when cafes are present or a cafe is selected.",
      "acceptanceCriteria": [
        "When the map is shown without any cafes/center override, the initial viewport is a world-level view (not a single-city default).",
        "When cafes are present, the map still centers as it does today (first cafe by default, and centers on a cafe when selected from the list)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cafes/CafeTileMap.tsx",
          "operation": "modify",
          "description": "Adjust initial center/zoom behavior: when no cafes and no centerOn override, initialize to a neutral worldwide-ready center and world-level zoom; when cafes exist or centerOn is provided, keep the current centering behavior and restore the current map-appropriate zoom level for results. Ensure offset state is reset appropriately when programmatically re-centering to preserve existing map/list coordination behavior."
        }
      ]
    }
  ]
}