{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allow cafe searches without keyword and support independent City/Area filters",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Update cafe search UI and React Query hook to allow searches with keyword optional, with independent City and Area filters passed to backend searchCafes.",
      "acceptanceCriteria": [
        "The search button is enabled when at least one of: keyword, city, or area has non-whitespace content.",
        "Submitting the form triggers a React Query search request when at least one field is provided; it does not require keyword.",
        "The frontend search hook includes keyword, city, and area in its queryKey and passes all three to actor.searchCafes(keyword, cityOrNull, areaOrNull).",
        "The UI provides separate inputs for City and Area (or otherwise captures both values distinctly) and uses English labels/placeholders.",
        "The empty state and results summary text correctly reflect searches that may omit keyword (e.g., city-only/area-only searches do not display misleading 'Showing results for \"\"')."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCafeSearch.ts",
          "operation": "modify",
          "description": "Update useCafeSearch to accept keyword, city, and area; enable searching when any field is non-blank; include keyword/city/area in the React Query queryKey; and pass all three values to actor.searchCafes(keyword, cityOrNull, areaOrNull). Ensure it returns an empty array and does not query when all three inputs are blank."
        },
        {
          "path": "frontend/src/pages/CafeSearchPage.tsx",
          "operation": "modify",
          "description": "Update the search form to include separate City and Area inputs (using existing shadcn/ui Input and Button components; do not edit ui components). Verify the component's usage instructions before implementing. Update submit/disabled logic so searches run when any of keyword/city/area is provided (keyword optional). Ensure both city and area are captured distinctly, included in searchParams, passed into useCafeSearch, and the results summary text does not show misleading empty keyword text for city-only/area-only searches."
        },
        {
          "path": "frontend/src/components/cafes/EmptyState.tsx",
          "operation": "modify",
          "description": "Update EmptyState to accept and display keyword, city, and area context appropriately, including cases where keyword is omitted. Use existing shadcn/ui Alert component (compose only; do not edit ui components). Verify the component's usage instructions before implementing. Ensure guidance text appears only when all search fields are blank, and no-results text accurately reflects whichever filters were provided."
        }
      ]
    }
  ]
}